Revit 2027 API
ParameterTypeId.AllGridRotationForDivisionRule Property
 "All Grid Rotation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AllGridRotationForDivisionRule { get; }
Public Shared ReadOnly Property AllGridRotationForDivisionRule As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AllGridRotationForDivisionRule {
	ForgeTypeId^ get ();
}
static member AllGridRotationForDivisionRule : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace